testCases/heatTransfer/cht/constant/cylinder/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType constSolidThermo;

constSolidThermoCoeffs
{
    //- thermo properties
    rho rho [1 -3  0  0 0 0 0] 8000;
    Cp  Cp  [0  2 -2 -1 0 0 0] 450;
    K   K   [1  1 -3 -1 0 0 0] 80;

    //- radiation properties
    kappa kappa [0 -1 0 0 0 0 0]            0;
    sigmaS sigmaS [0 -1 0 0 0 0 0]          0;
    emissivity  emissivity  [0 0 0 0 0 0 0] 0;

    //- chemical properties
    Hf  Hf  [0  2 -2  0 0 0 0] 1;
}



solidComponents
(
    //pmma char
);

pmmaCoeffs
{
    transport
    {
        K0      0.152;
        n0      1.3;
        Tref    300; //K0*pow(T/Tref_, n0))
    }

    radiation
    {
        sigmaS      0.0;
        kappa       0.0;
        emissivity  0.1;
    }

    thermodynamics
    {
        Hf      0;
        C0      1462; // Cp = C0*(T/Tref)^n0
        Tref    300;
        n0      1.31;
    }

    density
    {
        rho     1114.0;
    }
}

charCoeffs
{
    transport
    {
        K0      0.4;
        n0      1.3;
        Tref    300; //K0*pow(T/Tref_, n0))
    }

    radiation
    {
        sigmaS      0.0;
        kappa       0.0;
        emissivity  0.0;
    }

    thermodynamics
    {
        Hf      0;
        C0      611.0;; // Cp = C0*(T/Tref)^n0
        Tref    300;
        n0      1.31;
    }

    density
    {
        rho     11.5;
    }
}

// ************************************************************************* //
