testCases/heatTransfer/cht/system/cylinder/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        FrontAndBack
        {
            type            empty;
        }
    }

    T
    {
        internalField   uniform 1000;


        boundaryField
        {
            FrontAndBack
            {
                type            empty;
            }
            
            "cylinder_to_.*"
            {
                type            compressible::turbulentTemperatureCoupledBaffleMixed;
                neighbourFieldName T;
                K               solidThermo;
                KName           none;
                value           uniform 300;
            }
        }
    }
}

// ************************************************************************* //
